<template>
  <div>
    <h2 class="text-5xl mb-8 text-gray-900 text-center">Бухгалтерские услуги</h2> 
    <ul class="list-none">
    <transition name="service-animation" v-for="item in accountingServices" :key="item.number">
    <li class="bg-blue-200 mb-4 mx-auto flex items-center px-4 item-block" v-if="item.show">
      <div v-html="item.svg"></div>
      <div class="w-[100%] flex flex-col ">
        <h4 class="text-2xl text-center">{{ item.title }}</h4>
      <hr class="h-px w-[40%] mx-auto my-1 bg-gray-200 border-0 dark:bg-gray-700">
      <p class="text-center px-8">{{ item.body }}</p>
    </div>
      
    </li></transition>
    <!-- <transition name="service-animation"><li class="bg-red-100" v-if="showItems">Услуга 2</li></transition>
    <transition name="service-animation"><li class="bg-red-100" v-if="showItems">Услуга 3</li></transition> -->
</ul>
  </div>
</template>

<script>
export default {
name: 'ServiceList',
data (){
    return {
        showItems : false,
        accountingServices : [
        {
            'number' : 1,
            'title' : 'Ведение бухгалтерского и налогового учета',
            'body' : 'Подготовим для вас все виды бухгалтерской отчетности.',
            'show' : false,
            'svg' : '<svg width="64px" height="64px" viewBox="-102.4 -102.4 1228.80 1228.80" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg" fill="#000000" transform="matrix(1, 0, 0, 1, 0, 0)"><g id="SVGRepo_bgCarrier" stroke-width="0"><rect x="-102.4" y="-102.4" width="1228.80" height="1228.80" rx="614.4" fill="#ffffff" strokewidth="0"></rect></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"><path d="M569.9 921.1H228V139h97.2c8.5 17.7 26.5 29.9 47.3 29.9h279.1c20.8 0 38.9-12.3 47.3-29.9h96.7v458.1c0 11 9 20 20 20s20-9 20-20V130.3c0-17.3-14.3-31.3-31.8-31.3H701.1c-7.2-20.3-26.7-35-49.5-35H372.5c-22.7 0-42.2 14.7-49.5 35H219.7c-17.5 0-31.8 14-31.8 31.3v799.6c0 17.3 14.3 31.3 31.8 31.3h350.2c11 0 20-9 20-20s-8.9-20.1-20-20.1z" fill="#201192"></path><path d="M706.4 404.6c0-11-9-20-20-20H319.1c-5.4-5.3-12.8-8.6-21.1-8.6-16.6 0-30 13.4-30 30s13.4 30 30 30c9.5 0 18-4.4 23.5-11.4h364.9c11 0 20-9 20-20zM706.4 542.1c0-11-9-20-20-20H322.1c-5.5-7.4-14.2-12.1-24.1-12.1-16.6 0-30 13.4-30 30s13.4 30 30 30c7.8 0 14.9-3 20.3-7.9h368.1c11 0 20-9 20-20zM320.1 660.6h-0.9c-5.4-5.4-12.9-8.8-21.2-8.8-16.6 0-30 13.4-30 30s13.4 30 30 30c9.5 0 17.9-4.4 23.4-11.2h297.2c11 0 20-9 20-20s-9-20-20-20H320.1zM950.2 529.4c-9.8-5.1-21.9-1.3-27 8.5L729.1 911l-143.6-78.6c-9.6-5.3-21.9-1.7-27.1 7.9-5.3 9.6-1.7 21.9 7.9 27.1l162.1 88.8c9.6 5.3 21.9 1.7 27.1-7.9 0.9-1.7 1.6-3.5 2-5.3l201.2-386.5c5.1-9.8 1.3-22-8.5-27.1z" fill="#201192"></path><path d="M723.8 335.1h-429c-14.8 0-26.8-12-26.8-26.8v-81.4c0-14.8 12-26.8 26.8-26.8h429c14.8 0 26.8 12 26.8 26.8v81.4c0 14.8-12 26.8-26.8 26.8z" fill="#1ee66b"></path></g></svg>'
        },
        {
            'number' : 2,
            'title' : 'Постановка и ведение кадрового учёта',
            'body' : 'Ведение кадрового учёта является непростым делом. Мы помогаем компаниям правильно вести кадровый учет, осуществлять расчет заработной платы, больничных, отпусков и сдавать отчетность по сотрудникам.',
            'show' : false,
            'svg' : '<svg width="64px" height="64px" viewBox="-102.4 -102.4 1228.80 1228.80" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg" fill="#000000"><g id="SVGRepo_bgCarrier" stroke-width="0"><rect x="-102.4" y="-102.4" width="1228.80" height="1228.80" rx="614.4" fill="#ffffff" strokewidth="0"></rect></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"><path d="M755.6 584.2H382c-14.6 0-26.8 11.8-28 26.9l-62.4 303.6v2c0 16.2 12.6 29.3 28 29.3h498.3c15.5 0 28-13.1 28-29.3v-2l-62.4-303.6c-1.2-15.1-13.3-26.9-27.9-26.9zM685.4 352.2c0 75.4-41.2 136.6-116.6 136.6s-136.6-61.2-136.6-136.6 61.2-136.6 136.6-136.6 116.6 61.2 116.6 136.6z" fill="#c6d0dd"></path><path d="M330.6 353.7c0 97.9 80.4 177.5 179.3 177.5 47.9 0 92.9-18.4 126.7-51.9 33.9-33.5 52.6-78.1 52.6-125.6 0-97.9-80.4-177.5-179.3-177.5-98.8 0-179.3 79.6-179.3 177.5z m179.3-137.5c76.8 0 139.3 61.7 139.3 137.5s-62.5 137.5-139.3 137.5-139.3-61.7-139.3-137.5 62.5-137.5 139.3-137.5zM750.4 545.2H270.9c-18.8 0-34.4 13.6-35.9 30.9l-80.1 348.8v2.3c0 18.6 16.2 33.7 36 33.7h639.5c19.9 0 36-15.1 36-33.7v-2.3l-80.1-348.8c-1.6-17.3-17.1-30.9-35.9-30.9zM196.8 920.9L274 585.2h234.7l-64.9 64.2c-2.9 2.9-4.1 7.1-3.1 11.1l61 241.4c3 11.8 19.9 11.8 22.9 0l61.1-241.4c1-4-0.2-8.2-3.1-11.1l-64.9-64.2h229.6l77.1 335.7H196.8z" fill="#201192"></path><path d="M285 352.6c2.1 0.7 4.2 1 6.2 1 8.4 0 16.2-5.4 19-13.8 3.4-10.5-2.3-21.8-12.8-25.2-32.2-10.5-66.5-48-66.5-96.6 0-62.3 51.4-113 114.5-113 35.8 0 65.4 17.7 88.2 52.7 6 9.3 18.4 11.9 27.7 5.9s11.9-18.4 5.9-27.7C437 89.5 394.9 65 345.4 65c-85.2 0-154.5 68.6-154.5 153 0 68.2 47.3 119.3 94.1 134.6zM195.8 671.9c0-11-9-20-20-20h-69.3L166.6 398h129.8c11 0 20-9 20-20s-9-20-20-20H161.2c-17.1 0-31.1 12.2-32.8 27.8L63.7 658.9v2.3c0 17 14.8 30.7 32.9 30.7h79.2c11 0 20-8.9 20-20zM560.1 163.1c9.3 6 21.6 3.4 27.7-5.9 22.8-35 52.5-52.8 88.3-52.8 63.2 0 114.6 50.7 114.6 113.1 0 48.7-34.3 86.2-66.6 96.7-10.5 3.4-16.2 14.7-12.8 25.2 2.8 8.4 10.6 13.8 19 13.8 2.1 0 4.2-0.3 6.2-1 46.8-15.3 94.2-66.5 94.2-134.7 0-84.4-69.4-153.1-154.6-153.1-49.5 0-91.6 24.6-121.8 71-6.1 9.3-3.5 21.7 5.8 27.7zM894.2 385.5c-1.6-15.6-15.7-27.8-32.8-27.8H726c-11 0-20 9-20 20s9 20 20 20h129.9l60.2 254.2h-69.4c-11 0-20 9-20 20s9 20 20 20H926c18.2 0 32.9-13.8 32.9-30.8v-2.3l-64.7-273.3z" fill="#201192"></path></g></svg>'
        },
        {
            'number' : 3,
            'title' : 'Заполнение 3-НДФЛ',
            'body' : 'Если вы стали счастливым обладателем квартиры,  получили дорогостоящее лечение или оплачиваете свое образование вы можете получить налоговый вычет от государтсва. Поготовим за вас декларацию и проконсультируем Вас по документам.',
            'show' : false,
            'svg' : '<svg version="1.1" id="_x32_" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="64px" height="64px" viewBox="-51.2 -51.2 614.40 614.40" xml:space="preserve" fill="#000000"><g id="SVGRepo_bgCarrier" stroke-width="0"><rect x="-51.2" y="-51.2" width="614.40" height="614.40" rx="307.2" fill="#ffffff" strokewidth="0"></rect></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <style type="text/css">  .st0{fill:#201192;}  </style> <g> <path class="st0" d="M273.975,108.679c2.547,0.672,5.234,1.094,8.047,1.328l0.047,8.094l9.875-0.063l-0.063-8.266 c1.328-0.188,2.625-0.422,3.875-0.75c2.828-0.766,5.266-1.891,7.297-3.391s3.625-3.359,4.766-5.563 c1.172-2.188,1.719-4.734,1.703-7.656c-0.031-4.891-1.547-8.609-4.516-11.141c-2.953-2.531-7.344-4.031-13.094-4.484l-7.781-0.594 c-2.766-0.281-4.75-0.922-5.906-1.953c-1.188-1-1.766-2.469-1.781-4.359c-0.016-2.094,0.781-3.828,2.422-5.172 c1.609-1.313,4.156-1.984,7.594-2c2.625-0.031,5.109,0.281,7.484,0.875c2.391,0.594,5.156,2.547,5.156,2.547 c0.625,0.313,1.391,0.188,1.875-0.328l4.609-4.75c0.359-0.359,0.516-0.875,0.422-1.375c-0.063-0.5-0.375-0.953-0.828-1.188 c0,0-3.672-2.828-7.141-3.734c-2.047-0.547-4.25-0.906-6.547-1.109l-0.047-7l-9.875,0.078l0.047,7.141 c-1.125,0.172-2.219,0.391-3.266,0.688c-2.516,0.75-4.719,1.875-6.594,3.328c-1.891,1.469-3.359,3.266-4.453,5.391 c-1.063,2.141-1.594,4.547-1.578,7.234c0.031,4.891,1.469,8.531,4.344,10.922c2.844,2.375,6.906,3.813,12.172,4.266l8.859,0.719 c2.703,0.281,4.625,0.953,5.75,2.016c1.156,1.109,1.719,2.594,1.734,4.484c0.016,2.641-1.109,4.578-3.406,5.844 c-2.281,1.25-5.172,1.875-8.688,1.906c-2.766,0.016-5.547-0.344-8.359-1.094c-2.813-0.734-6.547-3.922-6.547-3.922 c-0.641-0.391-1.469-0.281-2,0.234l-4.906,5.016c-0.359,0.328-0.516,0.828-0.453,1.328c0.047,0.5,0.344,0.938,0.781,1.188 C265.006,103.413,270.1,107.647,273.975,108.679z"></path> <path class="st0" d="M287.334,161.71c43.813-0.313,79.063-36.078,78.75-79.891c-0.297-43.813-36.078-79.094-79.891-78.766 c-43.813,0.313-79.078,36.078-78.766,79.891C207.725,126.757,243.506,162.022,287.334,161.71z M286.334,22.882 c32.813-0.219,59.688,26.266,59.938,59.063c0.219,32.828-26.281,59.703-59.094,59.938s-59.688-26.266-59.922-59.078 S253.521,23.116,286.334,22.882z"></path> <path class="st0" d="M507.412,168.288c-3.469-1.156-7.219,0.75-8.344,4.234c-2.938,8.938-6.922,14.016-11.406,17.406 c-1.313,1-2.719,1.813-4.188,2.547c0.719-2.703,1.094-5.516,1.063-8.344c-0.031-4.484-1.047-9.078-3.547-13.172 c-2.141-3.547-5.141-6.344-8.547-8.188c-3.422-1.859-7.25-2.813-11.125-2.797c-3.75,0.016-7.563,1-11.031,2.969 c-0.063,0.016-0.109,0.031-0.156,0.078c-0.094,0.031-0.172,0.078-0.25,0.125h-0.031l0,0l-0.172,0.109l0,0 c-0.016,0-0.016,0-0.031,0.016c-0.109,0.078-0.219,0.188-0.344,0.266c-0.016,0-0.016,0.016-0.031,0.016 c-3.266,2.125-5.875,4.938-7.625,8.172c-1.859,3.406-2.828,7.234-2.797,11.125c0.016,3.984,1.109,8.031,3.297,11.656l0,0 c2.781,4.531,6.844,8.156,11.547,10.828c0.891,0.516,1.844,0.938,2.797,1.375c-2.172,1.391-4.625,2.703-7.328,3.828 c-3.578,1.484-7.625,2.609-12,3.234c-14.844-22.469-36.891-43.078-68.438-60.313c-5-2.734-10.141-5.125-15.344-7.234 c-8.75,9.125-19.328,16.484-31.188,21.406c-4.656,1.969-5.141,5.906,0.281,6.547c4.844,0.563,9.625,1.25,14.422,2.031l0.172,23.844 c-40.313-4.797-70.313-4.594-110.547,0.781l-0.172-23.828c6.813-1.234,13.688-2.234,20.578-3.031 c6.391-0.703,6.281-5.328,0.297-8.172c-11.297-5.375-21.328-12.984-29.531-22.234c-25.172,7.078-47.516,17.203-64.016,27.672 c-29.671-18.484-55.921-13.422-63.875-11.031l11.281,57.922c-21.516,27.016-38.953,36.141-38.953,36.141l-43.828,8.984 c-6.203,0.031-11.984,3.203-15.359,8.406c-3.359,5.219-3.875,11.766-1.391,17.438l34.375,95.781 c2.984,6.734,9.656,11.063,17.016,11l72.078,14.563l30.89,76.203c15.422,33.484,56.016,26.172,57.438-1.5l6.234-37.969 l105.141-0.75c0,0,3.375,16.875,5.094,31.406c2.594,21.922,35.047,50.141,67.25,6.016c37.078-50.797,95.969-166.969,47.266-258.016 c6.125-1.422,11.688-3.563,16.391-6.203c4.031-2.266,7.5-4.844,10.391-7.5c1.063-0.969,2.016-1.953,2.906-2.938 c0.063-0.016,0.125-0.016,0.188-0.047l0.016,0.031c7.047-1.234,14.609-3.547,21.406-8.641c6.813-5.094,12.484-12.922,16.047-23.906 C512.803,173.132,510.896,169.413,507.412,168.288z M470.178,190.71c-0.703,2.063-1.75,4-2.953,5.563 c-2.281-0.328-4.766-1.188-7-2.469c-2.984-1.656-5.484-4.047-6.734-6.172v0.016c-0.953-1.563-1.391-3.219-1.391-4.891 c-0.016-1.625,0.406-3.266,1.172-4.688c0.781-1.406,1.891-2.609,3.375-3.516c1.516-0.891,3.125-1.313,4.75-1.328 c1.625-0.031,3.266,0.391,4.688,1.172c1.438,0.781,2.672,1.938,3.594,3.438c1,1.656,1.578,3.844,1.594,6.391 C471.318,186.304,470.912,188.569,470.178,190.71z"></path> </g> </g></svg>'
        }
    ]
    }
},
computed : {
    createObserver() {
        const options = {
          root: null,
          threshold: 1
        };
        const observer = new IntersectionObserver(this.handleIntersect, options);
        console.log('its job', this.$el)
        observer.observe(this.$el);
      },getItem(){
        if (this.showItems) {
            if (this.timeOut < 5000) {
            this.timeOut += 500 }
        return setTimeout(()=>true, this.timeOut)
        }
    },
}, methods:{
    
    showServiceItem() {
        this.accountingServices.forEach(i=>setTimeout(()=>i.show=true, i.number * 500))
      },
    handleIntersect(entries, observer) {
        entries.forEach(entry => {
          if (entry.isIntersecting) {
            this.showServiceItem();
            console.log(this.$el.getElementsByTagName('li'))
              observer.unobserve(this.$el);
          }
        });
      }
}, mounted(){
    if (process.client) {
    if (window["IntersectionObserver"]) {
        console.log('lazy if', this.$el)
        this.createObserver;
        
      } else {
        this.showServiceItem();
        console.log('lazy else')
      }
  }}
}
</script>

<style scoped>
/* .service-animation {
    animation: myAnim 2s cubic-bezier(0.36, 0, 0.66, -0.56) 0s 1 normal forwards;
}
@keyframes myAnim {
	0% {
		opacity: 0;
		transform: translateX(-250px);
	}

	100% {
		opacity: 1;
		transform: translateX(0);
	}
} */
.service-animation-enter-active {
  transition: all 1.5s ease;
  /* transition-delay: 1s; */
}

/* .service-animation-enter-active:first-of-type + .service-animation-enter-active {
transform: translateX(-100%);
  opacity: 0;
  color: red;
} */
.service-animation-enter
/* .slide-fade-leave-active до версии 2.1.8 */ {
  transform: translateX(100%);
  /* transition-delay: 1s; */
  opacity: 0;
}
.service-animation-enter:nth-child(even){
  transform: translateX(-100%);
}
/* .item-block:nth-child(even) {
  flex-direction: row-reverse;
}  */
ul {
    min-height: 70vh;
}
li {
  max-width: 95%;
  height: 200px;
  border-radius: 2rem;
}
</style>